//დაწერეთ პროგრამა რომელიც კონსოლში გამოიტანს "Hello World" -ს.
console.log('Hello world');
//შექმენით ცვლადი და მიანიჭეთ მას რიცხვი. დაბეჭდეთ ცვლადის მნიშვნელობა.
let X = 5;
console.log(X);
//დაწერეთ პროგრამა ორი რიცხვის შესაკრებად და შედეგის გამოსატანად.
console.log(7+5);
//დაწერეთ პროგრამა რომელიც გამოაკლებს ორ რიცხვს ერთმანეთს და აჩვენებს შედეგს.
console.log(20-3);
//დაწერეთ პროგრამა ორი რიცხვის გასამრავლებლად და შედეგის გამოსატანად.
console.log(20*10);
//დაწერეთ პროგრამა ორი რიცხვის გასაყოფად და შედეგის გამოსატანად.
console.log(10/2);
//დაწერეთ პროგრამა ორი რიცხვის გაყოფის ნაშთის გამოსათვლელად.
console.log(20%2);
//შექმენით ცვლადი და მიანიჭეთ მას სტრიქონი. ამობეჭდეთ სტრიქონის სიგრძე.
let str="Hello world";
console.log (str.length );
//დაწერეთ პროგრამა ორი სტრიქონის შესაერთებლად და შედეგის ჩვენების მიზნით.
console.log("Hello " + " world");
//დაწერეთ პროგრამა სტრიქონის დიდ ასოებზე გადასაყვანად.
let string = "welcome";
string = string.toUpperCase();
console.log(string);
//დაწერეთ პროგრამა სტრიქონის მცირე ასოზე გადასაყვანად.
let string2 = "welcome";
string2 = string2.toLowerCase();
console.log(string2);
